nxp-mcuxpresso/mcux-soc-svd/MCXA577/MCXA577.xml
        <register>
          <name>INTENSET2</name>
          <description>Interrupt Enable Set1</description>
          <addressOffset>0x172</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PHYSCOL</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCAREC</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLCDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLCEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCASTAT</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLCDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLCEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODESTAT</name>
              <description>Mode status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODEDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODEEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVLDAPB</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVLDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVLEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCJAB</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REMJAB</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REMDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REMEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINFAULT</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PINDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PINEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCADIAG</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLCADIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLCEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMIACCESS</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMIDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMIEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCLWK</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCLDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCLEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSPDET</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSPDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSPEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUTDET</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WUTDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUTEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDONE</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WUPDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUPEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APBPARITY</name>
              <description>write 1 enables corresponding interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APBDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBEN</name>
                  <description>ENABLED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR2</name>
          <description>Interrupt Enable Clear2</description>
          <addressOffset>0x174</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PHYSCOL</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCAREC</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCASTAT</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODESTAT</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVLDAPB</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCJAB</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REMJAB</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINFAULT</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PNDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PNEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLCADIAG</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMIACCESS</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCLWK</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSPDET</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSPDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSPEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUTDET</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WUDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPDONE</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APBPARITY</name>
              <description>write 1 disables corresponding interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADIS</name>
                  <description>NO_EFFECT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AEN</name>
                  <description>DISABLE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
