nxp-mcuxpresso/mcux-soc-svd/MCXA577/MCXA577.xml
        <register>
          <name>TIMER1</name>
          <description>TIMER1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TVDPSRC_ON</name>
              <description>Time Period Comparator Enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1018</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1019</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1020</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1021</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1022</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1023</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDCD_DBNC</name>
              <description>Time Period to Debounce D+ Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1018</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1019</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1020</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1021</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1022</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1023</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2_BC11</name>
          <description>TIMER2_BC11</description>
          <alternateGroup>BC11</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x280001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHECK_DM</name>
              <description>Time Before Check of D- Line</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 15 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 15 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_11</name>
                  <description>1 ms - 15 ms</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_12</name>
                  <description>1 ms - 15 ms</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_13</name>
                  <description>1 ms - 15 ms</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_14</name>
                  <description>1 ms - 15 ms</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_15</name>
                  <description>1 ms - 15 ms</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TVDPSRC_CON</name>
              <description>Time Period Before Enabling D+ Pullup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1018</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1019</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1020</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1021</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1022</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1023</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2_BC12</name>
          <description>TIMER2_BC12</description>
          <alternateGroup>BC12</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TVDMSRC_ON</name>
              <description>TVDMSRC_ON</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_0</name>
                  <description>0 ms - 40 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_35</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_36</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_37</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_38</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_39</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_40</name>
                  <description>0 ms - 40 ms</description>
                  <value>0x28</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWAIT_AFTER_PRD</name>
              <description>TWAIT_AFTER_PRD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1018</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1019</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1020</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1021</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1022</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1023</name>
                  <description>1 ms - 1023 ms</description>
                  <value>0x3FF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
