nxp-mcuxpresso/mcux-soc-svd/MCXA577/MCXA577.xml
        <register>
          <name>DEVICE_TYPE</name>
          <description>Device Type</description>
          <addressOffset>0x7F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2000</resetValue>
          <resetMask>0xF000</resetMask>
          <fields>
            <field>
              <name>DEVICE_TYPE_NUM</name>
              <description>Indicates the device part number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEVICE_TYPE_SEC</name>
              <description>Indicates the device type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_SEC</name>
                  <description>Non Secure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVICE_TYPE_PKG</name>
              <description>Indicates the device's package type</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HLQFP</name>
                  <description>HLQFP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HTQFP</name>
                  <description>HTQFP</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGA</name>
                  <description>BGA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HDQFP</name>
                  <description>HDQFP</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QFN</name>
                  <description>QFN</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSP</name>
                  <description>CSP</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LQFP</name>
                  <description>LQFP</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVICE_TYPE_PIN</name>
              <description>Indicates the device's pin number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICE_ID0</name>
          <description>Device ID</description>
          <addressOffset>0x7F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF00FFF00</resetMask>
          <fields>
            <field>
              <name>RAM_SIZE</name>
              <description>Indicates the device's ram size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_8KB</name>
                  <description>8KB.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_16KB</name>
                  <description>16KB.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_32KB</name>
                  <description>32KB.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_64KB</name>
                  <description>64KB.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_96KB</name>
                  <description>96KB.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_128KB</name>
                  <description>128KB.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_160KB</name>
                  <description>160KB.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_192KB</name>
                  <description>192KB.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_256KB</name>
                  <description>256KB.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_288KB</name>
                  <description>288KB.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_352KB</name>
                  <description>352KB.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_512KB</name>
                  <description>512KB.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_640KB</name>
                  <description>640KB.</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_SIZE</name>
              <description>Indicates the device's flash size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_32KB</name>
                  <description>32KB.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_64KB</name>
                  <description>64KB.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_128KB</name>
                  <description>128KB.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_256KB</name>
                  <description>256KB.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_512KB</name>
                  <description>512KB.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_768KB</name>
                  <description>768KB.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_1MB</name>
                  <description>1MB.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_1P5MB</name>
                  <description>1.5MB.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_2MB</name>
                  <description>2MB.</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROM_REV_MINOR</name>
              <description>Indicates the device's ROM revision</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURITY</name>
              <description>no description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Secure version. (All values other than 1010b represent the secure version.)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_SEC</name>
                  <description>Non secure version.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
