nxp-mcuxpresso/mcux-soc-svd/MCXA577/MCXA577.xml
                  <description>Active only during a low-leakage mode. You can modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Do not modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC24</name>
              <description>Wake-up Pin Mode Configuration for LLWU_P24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. You can modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Do not modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC25</name>
              <description>Wake-up Pin Mode Configuration for LLWU_P25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. You can modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Do not modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC26</name>
              <description>Wake-up Pin Mode Configuration for LLWU_P26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. You can modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Do not modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPMC27</name>
              <description>Wake-up Pin Mode Configuration for LLWU_P27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. You can modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Do not modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved28</name>
              <description>Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved29</name>
              <description>Reserved</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUPMC30</name>
              <description>Wake-up Pin Mode Configuration for LLWU_P30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during a low-leakage mode. You can modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes. Do not modify the corresponding fields within Pin Enable (PEn) or Pin DMA/Trigger Configuration (PDCn).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved31</name>
              <description>Reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMC</name>
          <description>Pin Filter Mode Configuration</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILTM1</name>
              <description>Filter Mode for FILTn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during LLS/VLLS mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTM2</name>
              <description>Filter Mode for FILTn</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_PWR_ONLY</name>
                  <description>Active only during LLS/VLLS mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_PWR</name>
                  <description>Active during all power modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
