nxp-mcuxpresso/mcux-soc-svd/MCXA577/MCXA577.xml
        <register>
          <name>WAKENA</name>
          <description>Wake-up Enable A</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POR_DET</name>
              <description>POR Detect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAKEUP_FLAG</name>
              <description>Wake-up Pin Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER0_FLAG</name>
              <description>Bandgap Timer 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER1_FLAG</name>
              <description>Bandgap Timer 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_RDY</name>
              <description>LDO Ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_RDY</name>
              <description>OSC32K Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_DET</name>
              <description>Clock Detect</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ0_DET</name>
              <description>Interrupt 0 Detect</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ1_DET</name>
              <description>Interrupt 1 Detect</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ2_DET</name>
              <description>Interrupt 2 Detect</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ3_DET</name>
              <description>Interrupt 3 Detect</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKA</name>
          <description>Lock A</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables lock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables lock. Cleared by VBAT POR.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKECFG</name>
          <description>Wake-up Configuration</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT</name>
              <description>Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Logic zero (asserted)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Logic one</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCTLA</name>
          <description>Oscillator Control A</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC_EN</name>
              <description>Crystal Oscillator Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_BYP_EN</name>
              <description>Crystal Oscillator Bypass Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Does not bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COARSE_AMP_GAIN</name>
              <description>Amplifier Gain Coarse Adjustment</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAIN05</name>
                  <description>ESR Range 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN10</name>
                  <description>ESR Range 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN18</name>
                  <description>ESR Range 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAIN33</name>
                  <description>ESR Range 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_SEL_EN</name>
              <description>Crystal Load Capacitance Selection Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTAL_CAP_SEL</name>
              <description>Crystal Load Capacitance Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL0</name>
                  <description>0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL2</name>
                  <description>2 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL4</name>
                  <description>4 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL6</name>
                  <description>6 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL8</name>
                  <description>8 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL10</name>
                  <description>10 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL12</name>
                  <description>12 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL14</name>
                  <description>14 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL16</name>
                  <description>16 pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL18</name>
                  <description>18 pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL20</name>
                  <description>20 pF</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL22</name>
                  <description>22 pF</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL24</name>
                  <description>24 pF</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL26</name>
                  <description>26 pF</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL28</name>
                  <description>28 pF</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL30</name>
                  <description>30 pF</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTAL_CAP_SEL</name>
              <description>Crystal Load Capacitance Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL0</name>
                  <description>0 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL2</name>
                  <description>2 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL4</name>
                  <description>4 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL6</name>
                  <description>6 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL8</name>
                  <description>8 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL10</name>
                  <description>10 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL12</name>
                  <description>12 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL14</name>
                  <description>14 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL16</name>
                  <description>16 pF</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL18</name>
                  <description>18 pF</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL20</name>
                  <description>20 pF</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL22</name>
                  <description>22 pF</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL24</name>
                  <description>24 pF</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL26</name>
                  <description>26 pF</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL28</name>
                  <description>28 pF</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEL30</name>
                  <description>30 pF</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE_EN</name>
              <description>Mode Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HP</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Startup mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Low power mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_DET</name>
              <description>Supply Detector Trim</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L3VSUPPLY</name>
                  <description>VBAT supply is less than 3V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G3VSUPPLY</name>
                  <description>VBAT supply is greater than 3V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
