nxp-mcuxpresso/mcux-soc-svd/MCXA577/MCXA577.xml
        <register>
          <name>SHIELD_SEL_69_64</name>
          <description>Shield mode channels selection(CH69~CH64)</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_SHIELD_69_64</name>
              <description>Config TSI channel as shield mode among CH69~CH64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTUAL_TX_SEL_31_0</name>
          <description>Mutual TX mode channels selection(CH31~CH0)</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_MUTUAL_TX_31_0</name>
              <description>Config TSI channel as mutual TX mode among CH31~CH0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTUAL_TX_SEL_63_32</name>
          <description>Mutual TX mode channels selection(CH63~CH32)</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_MUTUAL_TX_63_32</name>
              <description>Config TSI channel as mutual TX mode among CH63~CH32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTUAL_TX_SEL_69_64</name>
          <description>Mutual TX mode channels selection(CH69~CH64)</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_MUTUAL_TX_69_64</name>
              <description>Config TSI channel as mutual TX mode among CH69~CH64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTUAL_RX_SEL_31_0</name>
          <description>Mutual RX mode channels selection(CH31~CH0)</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_MUTUAL_RX_31_0</name>
              <description>Config TSI channel as mutual RX mode among CH31~CH0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTUAL_RX_SEL_63_32</name>
          <description>Mutual RX mode channels selection(CH63~CH32)</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_MUTUAL_RX_63_32</name>
              <description>Config TSI channel as mutual RX mode among CH63~CH32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTUAL_RX_SEL_69_64</name>
          <description>Mutual RX mode channels selection (CH69~CH64)</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_MUTUAL_RX_69_64</name>
              <description>Config TSI channel as mutual RX mode among CH69~CH64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>TSI Data and Status Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSICNT</name>
              <description>TSI Conversion Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSICNT_OVERFLOW_FLAG</name>
              <description>TSI Counter Overflow Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSICNT_OVERFLOW_FLAG_0</name>
                  <description>The DATA[TSICNT] value has no overflow occurrence in the last scan process</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSICNT_OVERFLOW_FLAG_1</name>
                  <description>The DATA[TSICNT] value has an overflow occurrence in the last scan process</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOSF</name>
              <description>End of Scan Flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EOSF_0</name>
                  <description>Scan is not done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOSF_1</name>
                  <description>Scan is done</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERRUNF</name>
              <description>Overrun Flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRUNF_0</name>
                  <description>There is trigger or ips bus writing during scan progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRUNF_1</name>
                  <description>There is no trigger or ips bus writing during scan progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTRGF</name>
              <description>Out of Range Flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTRGF_0</name>
                  <description>The counter value is not out of range</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTRGF_1</name>
                  <description>The counter value is out of range</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD_OUTRGF</name>
              <description>DPD Out of Range Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPD_OUTRGF_0</name>
                  <description>The counter value is not out of range</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPD_OUTRGF_1</name>
                  <description>The counter value is out of range</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>TSI Miscellaneous Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAP_BANK_2500FF</name>
              <description>Enable the 2500fF caps inside cap bank</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_0</name>
                  <description>Enable another 2.5 pF in cap bank</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_1</name>
                  <description>Enable another 5.0 pF in cap bank</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_2</name>
                  <description>Enable another 7.5 pF in cap bank</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_3</name>
                  <description>Enable another 10 pF in cap bank</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_4</name>
                  <description>Enable another 12.5 pF in cap bank</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_5</name>
                  <description>Enable another 15 pF in cap bank</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_6</name>
                  <description>Enable another 17.5 pF in cap bank</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_2500FF_7</name>
                  <description>Enable another 20 pF in cap bank</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_BANK_312FF</name>
              <description>Enable the 312fF caps inside cap bank</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_0</name>
                  <description>Enable another 0.3125 pF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_1</name>
                  <description>Enable another 0.625 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_2</name>
                  <description>Enable another 0.936 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_3</name>
                  <description>Enable another 1.25 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_4</name>
                  <description>Enable another 1.56 pF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_5</name>
                  <description>Enable another 1.87 pF</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_6</name>
                  <description>Enable another 2.19 pF</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_312FF_7</name>
                  <description>Enable another 2.5 pF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD_MODE_ENABLE</name>
              <description>DPD_MODE_ENABLE</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPD_MODE_ENABLE_0</name>
                  <description>Configuration information in 3v domain logic is latched</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPD_MODE_ENABLE_1</name>
                  <description>Configuration information in 3v domain logic is updating from configuration registers simultaneously</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_BANK_148FF</name>
              <description>CAP_BANK_148FF</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_0</name>
                  <description>Enable another 148 pF in cap bank</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_1</name>
                  <description>Enable another 296 pF in cap bank</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_2</name>
                  <description>Enable another 444 pF in cap bank</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_3</name>
                  <description>Enable another 592 pF in cap bank</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_4</name>
                  <description>Enable another 740 pF in cap bank</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_5</name>
                  <description>Enable another 888 pF in cap bank</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_6</name>
                  <description>Enable another 1036 pF in cap bank</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_148FF_7</name>
                  <description>Enable another 1184 pF in cap bank</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_BANK_EN</name>
              <description>Cap bank function enable signal</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAP_BANK_EN_0</name>
                  <description>Disable cap bank function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_BANK_EN_1</name>
                  <description>Enable cap bank function</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_DIVIDER</name>
              <description>TSI Clock Divider</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNTING_CLK_HIGH</name>
              <description>COUNTING_CLK_HIGH</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNTING_CLK_HIGH_0</name>
                  <description>Using default process inside SSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTING_CLK_HIGH_1</name>
                  <description>Follow the counting signal from AIP front end</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
